constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     1.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


22
(
    inletTube_inletTube-inlet_inlet
    {
        type            patch;
        nFaces          476;
        startFace       4450377;
    }

    inletTube_inletTube-wall_wall
    {
        type            wall;
        nFaces          4873;
        startFace       4450853;
    }

    interface_inletTube_volute_outlet
    {
        type            cyclicAMI;
        nFaces          5180;
        startFace       4455726;
        neighbourPatch  interface_volute_inletTube_inlet;
        transformType   none;
        matchTolerance  0.01;
        lowWeightCorrection 0.2;
    }

    impeller_impeller-blades_wall
    {
        type            wall;
        nFaces          72293;
        startFace       4460906;
    }

    impeller_impeller-bladeFillets_wall
    {
        type            wall;
        nFaces          31899;
        startFace       4533199;
    }

    impeller_impeller-innerHub_wall
    {
        type            wall;
        nFaces          19594;
        startFace       4565098;
    }

    impeller_impeller-innerShroud_wall
    {
        type            wall;
        nFaces          18942;
        startFace       4584692;
    }

    interface_impeller_volute_inlet
    {
        type            cyclicAMI;
        nFaces          4428;
        startFace       4603634;
        neighbourPatch  interface_volute_impeller_outlet;
        transformType   none;
        matchTolerance  0.01;
        lowWeightCorrection 0.2;
    }

    interface_impeller_volute_outlet
    {
        type            cyclicAMI;
        nFaces          20410;
        startFace       4608062;
        neighbourPatch  interface_volute_impeller_inlet;
        transformType   none;
        matchTolerance  0.01;
        lowWeightCorrection 0.2;
    }

    volute_impeller-outerHub_wall
    {
        type            wall;
        nFaces          62088;
        startFace       4628472;
    }

    volute_volute-spiral_wall
    {
        type            wall;
        nFaces          131972;
        startFace       4690560;
    }

    volute_volute-shroudWithLeakage_wall
    {
        type            wall;
        nFaces          134124;
        startFace       4822532;
    }

    volute_impeller-hubWall_wall
    {
        type            wall;
        nFaces          2056;
        startFace       4956656;
    }

    volute_impeller-shroudWall_wall
    {
        type            wall;
        nFaces          15486;
        startFace       4958712;
    }

    volute_impeller-outerShroud_wall
    {
        type            wall;
        nFaces          115848;
        startFace       4974198;
    }

    interface_volute_inletTube_inlet
    {
        type            cyclicAMI;
        nFaces          5452;
        startFace       5090046;
        neighbourPatch  interface_inletTube_volute_outlet;
        transformType   none;
        matchTolerance  0.01;
        lowWeightCorrection 0.2;
    }

    interface_volute_impeller_inlet
    {
        type            cyclicAMI;
        nFaces          20544;
        startFace       5095498;
        neighbourPatch  interface_impeller_volute_outlet;
        transformType   none;
        matchTolerance  0.01;
        lowWeightCorrection 0.2;
    }

    interface_volute_impeller_outlet
    {
        type            cyclicAMI;
        nFaces          4472;
        startFace       5116042;
        neighbourPatch  interface_impeller_volute_inlet;
        transformType   none;
        matchTolerance  0.01;
        lowWeightCorrection 0.2;
    }

    interface_volute_voluteExtension_outlet
    {
        type            cyclicAMI;
        nFaces          1307;
        startFace       5120514;
        neighbourPatch  interface_voluteExtension_volute_inlet;
        transformType   none;
        matchTolerance  0.01;
        lowWeightCorrection 0.2;
    }

    voluteExtension_voluteExtension-wall_wall
    {
        type            wall;
        nFaces          9731;
        startFace       5121821;
    }

    voluteExtension_voluteExtension-outlet_outlet
    {
        type            patch;
        nFaces          386;
        startFace       5131552;
    }

    interface_voluteExtension_volute_inlet
    {
        type            cyclicAMI;
        nFaces          969;
        startFace       5131938;
        neighbourPatch  interface_volute_voluteExtension_outlet;
        transformType   none;
        matchTolerance  0.01;
        lowWeightCorrection 0.2;
    }

)


// ************************************************************************* //
