0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
 *---------------------------------------------------------------------------*
   File created by CFD support s.r.o.  on   Sat Jun  5 20:02:16 2021
                     http://www.cdfsupport.com
 *---------------------------------------------------------------------------*
   TCAE 21.02 licensed to:
      TCAE Test License
      Trial Version
      TCAE 21.02
      Annual
\*---------------------------------------------------------------------------*/
FoamFile
{
    version 2.0;
    format ascii;
    class volScalarField;
    location "TCFD/0";
    object p;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions [0 2 -2 0 0 0 0];

internalField uniform 0;

boundaryField
{
    inletTube_inletTube-inlet_inlet
    {
        type zeroGradient;
    }
    voluteExtension_voluteExtension-outlet_outlet
    {
        type fixedMean;
        meanValue tableFile;
        meanValueCoeffs
        {
            file "$FOAM_CASE/constant/boundaryConditions/p.outlet_voluteExtension_voluteExtension-outlet_outlet";
            format foam;
        }
        value $internalField;
    }
    interface_volute_inletTube_inlet
    {
        type cyclicAMI;
    }
    interface_inletTube_volute_outlet
    {
        type cyclicAMI;
    }
    interface_volute_impeller_inlet
    {
        type cyclicAMI;
    }
    interface_impeller_volute_outlet
    {
        type cyclicAMI;
    }
    interface_impeller_volute_inlet
    {
        type cyclicAMI;
    }
    interface_volute_impeller_outlet
    {
        type cyclicAMI;
    }
    interface_voluteExtension_volute_inlet
    {
        type cyclicAMI;
    }
    interface_volute_voluteExtension_outlet
    {
        type cyclicAMI;
    }
    ".*_wall"
    {
        type zeroGradient;
    }
    ".*_ami"
    {
        type cyclicAMI;
    }
    ".*_empty"
    {
        type empty;
    }
    ".*_symm"
    {
        type symmetry;
    }
}

// ************************************************************************* //
