0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
 *---------------------------------------------------------------------------*
   File created by CFD support s.r.o.  on   Sat Jun  5 20:02:16 2021
                     http://www.cdfsupport.com
 *---------------------------------------------------------------------------*
   TCAE 21.02 licensed to:
      TCAE Test License
      Trial Version
      TCAE 21.02
      Annual
\*---------------------------------------------------------------------------*/
FoamFile
{
    version 2.0;
    format ascii;
    class volScalarField;
    location "TCFD/0";
    object k;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions [0 2 -2 0 0 0 0];

internalField uniform 0.113438;

boundaryField
{
    inletTube_inletTube-inlet_inlet
    {
        type turbulentIntensityKineticEnergyInlet;
        intensity 0.05;
        value $internalField;
    }
    interface_volute_inletTube_inlet
    {
        type cyclicAMI;
    }
    interface_inletTube_volute_outlet
    {
        type cyclicAMI;
    }
    interface_volute_impeller_inlet
    {
        type cyclicAMI;
    }
    interface_impeller_volute_outlet
    {
        type cyclicAMI;
    }
    interface_impeller_volute_inlet
    {
        type cyclicAMI;
    }
    interface_volute_impeller_outlet
    {
        type cyclicAMI;
    }
    interface_voluteExtension_volute_inlet
    {
        type cyclicAMI;
    }
    interface_volute_voluteExtension_outlet
    {
        type cyclicAMI;
    }
    inletTube_inletTube-wall_wall
    {
        type kqRWallFunction;
        value $internalField;
    }
    impeller_impeller-bladeFillets_wall
    {
        type kqRWallFunction;
        value $internalField;
    }
    impeller_impeller-blades_wall
    {
        type kqRWallFunction;
        value $internalField;
    }
    impeller_impeller-innerHub_wall
    {
        type kqRWallFunction;
        value $internalField;
    }
    impeller_impeller-innerShroud_wall
    {
        type kqRWallFunction;
        value $internalField;
    }
    volute_impeller-hubWall_wall
    {
        type kqRWallFunction;
        value $internalField;
    }
    volute_impeller-outerHub_wall
    {
        type kqRWallFunction;
        value $internalField;
    }
    volute_impeller-outerShroud_wall
    {
        type kqRWallFunction;
        value $internalField;
    }
    volute_impeller-shroudWall_wall
    {
        type kqRWallFunction;
        value $internalField;
    }
    volute_volute-shroudWithLeakage_wall
    {
        type kqRWallFunction;
        value $internalField;
    }
    volute_volute-spiral_wall
    {
        type kqRWallFunction;
        value $internalField;
    }
    voluteExtension_voluteExtension-wall_wall
    {
        type kqRWallFunction;
        value $internalField;
    }
    ".*_ami"
    {
        type cyclicAMI;
    }
    ".*_outlet"
    {
        type zeroGradient;
    }
    ".*_empty"
    {
        type empty;
    }
    ".*_symm"
    {
        type symmetry;
    }
}

// ************************************************************************* //
