system/calcSurfaceQuantitiesDict-FSI
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
 *---------------------------------------------------------------------------*
   File created by CFD support s.r.o.  on   Sat Jun  5 20:02:16 2021
                     http://www.cdfsupport.com
 *---------------------------------------------------------------------------*
   TCAE 21.02 licensed to:
      TCAE Test License
      Trial Version
      TCAE 21.02
      Annual
\*---------------------------------------------------------------------------*/
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    location "TCFD/system";
    object calcSurfaceQuantitiesDict-FSI;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

bcs
(
      impeller_impeller-bladeFillets_wall impeller_impeller-blades_wall impeller_impeller-innerHub_wall impeller_impeller-innerShroud_wall volute_impeller-hubWall_wall volute_impeller-outerHub_wall volute_impeller-outerShroud_wall volute_impeller-shroudWall_wall
);

rhoInf 998.2;

outputDirectory FSI;

useAveragedQuantities yes;

useK yes;

useNut yes;

// ************************************************************************* //
